-- phpMyAdmin SQL Dump
-- version 
-- http://www.phpmyadmin.net
--
-- Время создания: Авг 26 2018 г., 19:45
-- Версия сервера: 5.6.40
-- Версия PHP: 5.4.45-0+deb7u14

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

-- --------------------------------------------------------

--
-- Структура таблицы `comments`
--

CREATE TABLE IF NOT EXISTS `comments` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `date` datetime NOT NULL,
  `news_id` int(11) unsigned NOT NULL,
  `parent` int(11) unsigned NOT NULL,
  `depth` int(11) unsigned NOT NULL,
  `author` varchar(255) NOT NULL,
  `text` text NOT NULL,
  PRIMARY KEY (`id`),
  KEY `news_id` (`news_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=44 ;

--
-- Дамп данных таблицы `comments`
--

INSERT INTO `comments` (`id`, `date`, `news_id`, `parent`, `depth`, `author`, `text`) VALUES
(1, '2018-08-09 00:00:00', 1, 0, 0, 'Илья Борисыч', 'комент 1 к новости 1'),
(2, '2018-08-10 00:00:00', 1, 0, 0, 'Борисыч Илья', 'комент 2 к новости 1'),
(3, '2018-08-11 00:00:00', 1, 2, 1, 'Тоже я', 'комент 3 к новости 1\r\nродитель #2'),
(4, '2018-08-09 00:00:00', 1, 1, 1, 'И это я', 'комент 4 к новости 1\r\nродитель #1'),
(5, '2018-08-25 19:50:11', 1, 2, 1, 'Илюха Долгоруков', 'Это тестовый коммент'),
(6, '2018-08-25 19:53:56', 1, 2, 1, 'фывфыв', 'фывфыв'),
(7, '2018-08-25 20:32:04', 1, 1, 1, 'ффффф', 'ыыыыы'),
(8, '2018-08-25 20:33:58', 1, 1, 1, 'ййййй', 'ццццц'),
(9, '2018-08-25 20:35:14', 1, 1, 1, 'пппп', 'ррррр'),
(10, '2018-08-25 20:36:19', 1, 1, 1, 'нннннннннннннннн', 'нннннннннннннннн'),
(11, '2018-08-25 20:37:24', 1, 2, 1, 'вввввввв', 'ввввввввв'),
(12, '2018-08-25 20:38:23', 1, 2, 1, 'оооооооо', 'оооооооо'),
(13, '2018-08-25 20:42:20', 1, 2, 1, 'ааааааа', 'аааааааааа1'),
(14, '2018-08-25 20:48:38', 1, 2, 1, 'ббббббббб', 'бббббббб2'),
(15, '2018-08-25 20:50:23', 1, 2, 1, 'ввввввввввввв', 'ввввввввввввв3'),
(18, '2018-08-25 21:08:50', 1, 0, 0, 'ооооооор', 'рррррраааа'),
(19, '2018-08-25 21:09:20', 1, 18, 1, 'вавп', 'вапвапвп12345'),
(20, '2018-08-25 21:12:24', 1, 0, 0, 'ураааа', 'ываа'),
(21, '2018-08-25 21:43:50', 4, 0, 0, 'прпррп', 'ффффффффффффффффффффффффффффффффффффф\r\nааааааааа\r\nппппппппппп'),
(22, '2018-08-25 21:44:03', 4, 21, 1, 'впапв', 'апвапвп'),
(23, '2018-08-25 21:44:10', 4, 0, 0, 'ваап', 'ваппв567'),
(24, '2018-08-25 21:44:17', 4, 23, 1, 'вапв', 'ваппв'),
(25, '2018-08-25 21:44:33', 4, 0, 0, 'ваавп', 'вавпва34535'),
(26, '2018-08-25 21:45:06', 4, 25, 1, 'авпап', 'ваппа111'),
(27, '2018-08-25 21:45:17', 4, 25, 1, '22222', '222222222222'),
(28, '2018-08-25 22:18:55', 4, 0, 0, 'dgfg', 'dfgdgf'),
(29, '2018-08-25 22:37:54', 4, 0, 0, 'ffgfgfgf', 'fgfgfgfgfgf'),
(30, '2018-08-25 22:39:01', 4, 0, 0, 'sdasd', 'hhhhhhhhhhhhhhhhhh'),
(31, '2018-08-25 22:39:14', 4, 29, 1, 'fsdsdf', 'hhhhhhhhhhhhhhhhh'),
(32, '2018-08-26 16:47:45', 1, 0, 0, 'Илья Борисович', 'это тест!!!'),
(33, '2018-08-26 16:49:36', 6, 0, 0, 'Илья Борисович Долгоруков', 'кеуке'),
(34, '2018-08-26 17:08:36', 6, 0, 0, 'Илья Борисыч', 'вапвпвап'),
(35, '2018-08-26 17:10:14', 6, 0, 0, 'Илья Борисыч123', 'ыываыва'),
(36, '2018-08-26 17:10:35', 6, 0, 0, 'Илья Борисыч321', 'вапвапвап'),
(37, '2018-08-26 17:12:19', 6, 36, 1, 'Илюха Борисович Долгоруков', 'ываываыав'),
(38, '2018-08-26 19:24:14', 2, 0, 0, 'Илья Долгоруков', 'фывыфв'),
(39, '2018-08-26 19:24:22', 2, 38, 1, 'Илья Долгоруков', 'ываываыва'),
(40, '2018-08-26 19:24:27', 2, 0, 0, 'Илья Долгоруков', 'фывфывфыв'),
(41, '2018-08-26 19:40:19', 9, 0, 0, 'Илья Долгоруков', 'ывааыва'),
(42, '2018-08-26 19:40:23', 9, 41, 1, 'Илья Долгоруков', 'ываыва'),
(43, '2018-08-26 19:40:32', 9, 0, 0, 'Илья Долгоруков', 'ываыва');

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE IF NOT EXISTS `news` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `date` datetime NOT NULL,
  `author` varchar(255) NOT NULL,
  `title` varchar(255) NOT NULL,
  `short_text` varchar(255) NOT NULL,
  `full_text` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=10 ;

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `date`, `author`, `title`, `short_text`, `full_text`) VALUES
(1, '2018-08-10 00:00:00', 'Илья', 'Первая новость', 'Самая первая новость', 'Ура! Вот и появилась на нашем сайте первая новость!'),
(2, '2018-08-11 00:00:00', 'Илюха', 'Вторая новость', 'Уже вторая новость', 'Вааще копец! Уже вторая новость у нас!\r\nКруто!!!'),
(3, '2018-08-17 17:32:36', 'dfgd', 'fdgfg', 'dfgdfg', 'dfgfg'),
(4, '2018-08-25 15:16:42', 'ччсмсчм', 'чсмчсм', 'чсмчсм', 'чсмчсм'),
(5, '2018-08-25 18:42:43', 'апрарапр', 'апрапрапр', 'апрарр вап', 'апапрапрапр вавапвп'),
(6, '2018-08-26 16:48:58', 'Илья Борисович Долгоруков', 'тест123', 'это тест123', 'Это тест 123 !!!'),
(7, '2018-08-26 17:11:46', 'Илюха Долгоруков', 'ываыва', 'ываыва', 'ываыва'),
(8, '2018-08-26 19:24:54', 'Илья Долгоруков', 'ываываыва', 'ываываыва', 'ываыва ываыва\r\nываыва'),
(9, '2018-08-26 19:40:06', 'Илья Долгоруков', 'ываыва1111111', '111111111111', '11111111111111111111111111');

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `comments_ibfk_1` FOREIGN KEY (`news_id`) REFERENCES `news` (`id`) ON DELETE CASCADE;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
